app/controllers/gossips_controller.rb

  def create
    @gossip = Gossip.new(title: params[:title], content: params[:content], user: User.find(21))
# J'ai créé un user anonymous, son id est le 21, du coup le new gossip aura toutjours le user 21 pour l'instant.

    if @gossip.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"